[{"id":1,"name":"cool t-shirt","price":59.99,"quantity":18,"description":"Gildan is one of the world's largest vertically integrated manufacturers of apparel and socks. Gildan uses cotton grown in the USA, which represents the best combination of quality and value for Gildan's cotton and cotton blended products. Since 2009, Gildan has proudly displayed the Cotton USA mark, licensed by Cotton Council International, on consumer's product packaging and shipping materials. Gildan's environmental program accomplishes two core objectives: Reduce our environmental impact and preserve the natural resources being used in our manufacturing process. At all operating levels, Gildan is aware of the fact that we operate as a part of a greater unit: The environment in which we live and work.","type":"t-shirt","image":"https://ih1.redbubble.net/image.491441117.4117/gptr,1400x,front,black-c,188,133,1000,1000-bg,f8f8f8.u7.jpg"},{"id":2,"name":"comfy t-shirt","price":99.99,"quantity":8,"description":"Fruit of the Loom mens crews work great alone or to add an extra layer under a button-down or polo shirt. This shirt eliminates ride-up, it stays neatly tucked so you can go about your busy day with confidence. They are designed to maintain comfort and softness even after many washes. The improved, double-stitched collar stays flat and keeps its shape, providing a consistent look. This Fruit of the Loom t-shirt features a tag free designed to provide all-day comfort. There are soft covered seams on the neck and shoulders for extra comfort. Wear layered or by itself. Available in a variety of sizes, you can choose the ideal one for your body.","type":"t-shirt","image":"https://images.unsplash.com/photo-1621072156002-e2fccdc0b176?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80"},{"id":3,"name":"winter hoodie","price":200.0,"quantity":10,"description":"Featuring our warmest fleece, the Hanes Ultimate® heavyweight hoodie is a classic sweatshirt sure to become your new favorite. Crafted from a cotton-rich 9.7-oz. fabric that maintains its softness, this ultra-versatile mens pullover sweatshirt is great on its own, perfect layered under a jacket or vest, and ideal for pulling on over a tee or tank. You'll like the ribbed cuffs with relaxed waistband and appreciate the patented low-pill, high-stitch density fabric. A smooth Tagless® interior provides an itch-free fit while a roomy hood and warm kanga pouch pocket cut the chill when temperatures drop. Pair it with your favorite sweats or jeans for effortlessly cool style.","type":"hoodie","image":"https://images.unsplash.com/photo-1613922110510-502f37d20eb9?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80"},{"id":4,"name":"just hoodie","price":100.0,"quantity":5,"description":"Equal parts durable, comfortable and stylish, the Gildan Adult Fleece Hooded Sweatshirt belongs in every collection. Whether you are hanging out with friends or relaxing at home, this must-have delivers everything you want in a hoodie, including the perfect surface for making decorations pop.","type":"hoodie","image":"https://images.unsplash.com/photo-1615397587950-3cbb55f95b77?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80"},{"id":5,"name":"Cool Sweater","price":100.0,"quantity":20,"description":"When soft comfort is what you seek, the Gildan Adult Fleece Crewneck Sweatshirt is what you need. Made from a 50% U.S. Cotton/50% Polyester blend, this warm 8.0 oz sq/yd classic fit style looks great and makes a great canvas for decorating. Available in 18 colors in SM - 3XL.","type":"sweater","image":"https://m.media-amazon.com/images/I/91KOEKmjufL._AC_UY1000_.jpg"},{"id":6,"name":"Cute Bodysuit","price":40.0,"quantity":90,"description":"Our baby clothes are designed to keep your little one feeling at their best and to bring parents peace of mind. With easy-to-change features, safety features, and super soft fabrics, we offer baby girl clothes and baby boy clothes that are sure to fit any family’s needs. If you’re looking for baby sleepwear, we offer a wide range of baby pajamas, baby PJs, baby footies, baby sleepers, and baby fleece pajamas. We also offer baby socks and baby shoes. Our baby girl shoes are sure to add a special flair to her favorite baby outfits. We also offer many baby accessories that your little one will need, such baby sun hat, baby caps, baby hats, baby mittens, no scratch mittens, baby headbands, and baby girl headbands. Our baby bodysuits or baby Onesies® Brand bodysuits make excellent baby shower gifts, but we also offer baby gift sets. If you like to dress your baby with separates, be sure to check out our baby pants, baby shorts, baby shirts, baby tops, and baby bottoms. Our baby swimwear and baby swimsuits are a big hit too! If it’s bedding you’re looking for, we have crib sheets, changing pad, crib mobile, baby toys, baby blankets, baby gifts, swaddle blanket, and mattress protector. Our baby clothing sizing ranges from baby girl clothes preemie, baby boy clothes preemie, baby girl clothes newborn, baby boy clothes newborn, baby girl clothes 0-3 months, baby boy clothes 0-3 months, baby girl clothes 3-6 months, baby boy clothes 3-6 months, baby girl clothes 6-9 months, baby boy clothes 6-9 months, baby girl clothes 12 months, baby boy clothes 12 months, baby girl clothes 18 months, baby boy clothes 18 months, baby girl clothes 24 months, baby boy clothes 24 months, toddler girl clothes 2T, toddler boy clothes 2T, toddler girl clothes 3T, toddler boy clothes 3T, toddler girl clothes 4T, toddler boy clothes 4T, toddler girl clothes 5T, toddler boy clothes 5T.  We have all your baby stuff covered, whether it’s baby boy stuff or baby girl stuff!","type":"bodysuit","image":"https://cdn.shopify.com/s/files/1/1407/3324/products/LS-Smiling-Baby_320x.progressive.jpg"},{"id":7,"name":"Simple Joys Snap-Up Rompers","price":50.0,"quantity":40,"description":"Our baby girl winter clothes are easy to wear and take off, convenient for diaper changing with snaps closure design. And the pocket on baby girl overalls create more lovely impression, with this you can put napkins or something else. Your little lover will get a lot of compliments when she's in this set of newborn baby girl clothes.","type":"infant_t_romper","image":"https://m.media-amazon.com/images/I/912Kcj04weL._AC_UY879_.jpg"},{"id":8,"name":"Champion Men's Classic Muscle Tee","price":19.95,"quantity":20,"description":"Show off those muscles you've been building at the gym with Champion's pure cotton muscle tee. Long on Champion heritage style, this essential muscle T-shirt is knit from 1 US-grown ring-spun cotton for exceptional softness. Simple in style but packed with Champion quality, this muscle tee is detailed with a sturdy ribbed crew neck, dyed-to-match back neck tape that's soft against the skin, and reinforced shoulder seams and a higher stitch count for sturdiness. This better-than-basic tee proudly displays the brand's \"C\" in tonal embroidery on the left chest, with the \"C\" appliqué at the back of the neck.","type":"jersey_tank","image":"https://m.media-amazon.com/images/I/61TartYQ1AL._AC_UX679_.jpg"},{"id":9,"name":"Hanes Sport Men's Long-Sleeve T-Shirt ","price":39.95,"quantity":20,"description":"There's nothing like the comfort and style of Hanes Men's Clothing. Whether you’re on the go or just hanging out, Hanes Men's Activewear always delivers the fit, style and comfort you need. Hanes Men's Underwear works overtime to keep you comfortable for active and everyday activities. When you want comfort, fit and style, Hanes has got you covered.","type":"long_sleeve","image":"https://m.media-amazon.com/images/I/61WjFrh4lLL._AC_UX679_.jpg"}]